local function DeVx7(msg, danger)
local hash = "gp_lang:"..msg.chat_id_
local lang = redis:get(hash)
if danger[1] == "الاوامر" or danger[1] == "help" and is_mod(msg) then
if not lang then
text = [[
🛂 *!setowner* `[بلمعرف|ايدي|بلرد]` 
_لرفع مدير في المجموعه_

🛂 *!remowner* `[بلمعرف|ايدي|بلرد]` 
 _لتنزيل المدير_

🛂 *!promote* `[بلمعرف|ايدي|بلرد]` 
_لرفع ادمن_

🛂 *!demote* `[بلمعرف|ايدي|بلرد]` 
_Demote User From Group Admins List_

🛂 *!setflood* `[1-50]`
_لوضع عدد التكرار_

🛂 *!silent* `[بلمعرف|ايدي|بلرد]` 
_لكتم العضو في المجموعه_

🛂 *!unsilent* `[بلمعرف|ايدي|بلرد]` 
_لفتح كتم العضو في المجموع��_

🛂 *!kick* `[بلمعرف|ايدي|بلرد]` 
_لطرد العضو من المجموعه_

🛂 *!ban* `[بلمعرف|ايدي|بلرد]` 
_لحظر العضو في المجموعه_

🛂 *!unban* `[بلمعرف|ايدي|بلرد]` 
_لفتح حظر االعضو من المجموعه_

🛂 *!res* `[username]`
_Show User ID_

🛂 *!id* `[بلرد]`
_لعرض ايدي العضو_

🛂 *!whois* `[ايدي]`
_Show User's Username And Name_

🛂 *!n* `[lin | tag | ed | arabic | webpage | bots | spam | flo | mar | mention|gif | pho | document | stc | vid | txt | fwd | location | ado | voice | contact | all]`
_لقفل استعمل (n)_

🛂 *!un* `[lin | tag | edit | arabic | webpage | bots | spam | flo | mar | mention|gif | pho | document | stc | vid | txt | fwd | location | ado | voice | contact | all]`
_للفتح استعمل (un)_


🛂 *!set*`[rules | name | photo | link | about | welcome]`
_لوضع /القوانين/ترحيب/صورة/اسم/رابط_

🛂 *!clean* `[bans | mods | bots | rules | about | silentlist | filtelist | welcome]`   
_لمسح/القوانين/المكتومين/الترحيب/المحظورين/المدراء_

🛂 *!filter* `[word]`
_Word filter_

🛂 *!unfilter* `[word]`
_Word unfilter_

🛂 *!pin* `[بلرد]`
_لحضر العضو من المجموعه_

🛂 *!unpin* 
_لفتح الحضر من العضو_

🛂 *!settings*
_لعرض الاعدادات_

🛂 *!silentlist*
_لعرض المكتومين_

🛂 *!filterlist*
_Show Filtered Words List_

🛂 *!banlist*
_لعرض المحظورين_

🛂 *!ownerlist*
_لعرض المدراء في المجموعه_ 

🛂 *!modlist* 
_Show Group Moderators List_

🛂 *!rules*
_لعرض قوانين المجموعه الثابته_

🛂 *!about*
_Show Group Description_

🛂 *!id*
_لعرض ايدي المجموعه_

🛂 *!gpinfo*
_Show Group Information_

🛂 *!link*
_لعرض رابط المجموعه_

🛂 *!setwelcome [text]*
_لوضع ترحيب_

_You Can Use_ *[!/#]* _To Run The Commands_
_This Help List Only For_ *Moderators/Owners!*
_Its Means, Only Group_ *Moderators/Owners* _Can Use It!_

*Good luck ;)*
]]


elseif lang then
text = [[🔹اﮪـلا بـڪ ۶ـزيـزي الاوٱمــر هي  🔸

🔸 اولا اواامــر الـقفل 🔹
《 قفل + الامـر / للـقفل 🔐 》
《 فتح + الامـر / للـفتح 🔓 》

❂❂❂❂❂🔹❂🔹❂❂❂❂❂

- قـفل الروابـط 》لـقفل الروابـط📈
- قـفل التـ۶ـديل 》لـقفل التـ۶ـديل✂
- قـفل التـكرار  》لـقفل الـتڪرار📊
- قـفل الـكلايش 》لـقفل الـڪلايش📃
ـ قـفل التـاك 》لـقفل التـاك📍
ـ قـفل المـ۶ـرف  》لـقفل المعرف📌
- قـفل البـوتات 》لـقفل البـوتات📋
ـ قـفل المـاركداون 》لـقفل الماركداون🎫
- قـفل الـخدمة 》لـقفل الـخدمات📇
ـ قفل الصـور 》 لـقفل الـصور📷
ـ قفل الفـديو 》 لـقفل الفـديو📹
ـ قفل المـلفات 》لـقفل المـلفات📁
ـ قفل الصـوت 》 لـقفل الـصوت🔊
ـ قفل البصمات 》 لـقفل البصمة🎥
ـ قفل جهات الاتصال 》 لـقفل الجهات 🃏
ـ قفل الاعلانات 》 لـقفل الاعلانات و التوجيه🎭
ـ قفل الـدردشـة 》 لـقفل الدردشـه🎼
ـ قفل المتـحركة 》 لـقفل المتـحركه❄
ـ قفل الـكل 》 لـقفل الكـل✋
❂❂❂❂❂🔹❂🔹❂❂❂❂❂

اوامـر الـرفـ؏ :- ✨💙

ـ رفـ؏ ادمـن (بالرد + المـ۶ـرف + الايـدي)
- رفـ؏ مـدير (بالرد + المـ۶ـرف + الايـدي)

ـ تنزيل ادمـن (بالرد + المـ۶ـرف + الايـدي)
ـ تنزيل عـضو (بالرد + المـ۶ـرف + الايـدي)


❂❂❂❂❂🔹❂🔹❂❂❂❂❂

اوامر الادمنية :- 👮

- ضع قوانين
- ضع وصف
- ضع صورة
- ضع اسم
- ضع رابط
- ضع ترحيب
- منع + كلمة 
-الغاء منع + الكلمة

❂❂❂❂❂🔹❂🔹❂❂❂❂❂

اوامر المسح :- 🚨

- مسح المكتومين
- مسح البوتات
-مسح الوصف
- مسح الكلمات الممنوعة
- مسح الترحيب
-مسح الادمنية
-مسح المحضورين
-مسح القوانين

❂❂❂❂❂🔹❂🔹❂❂❂❂❂
اوامر اضافية :- 🃏

- تثبيت (بالرد) : لتثبيت الكلمة للكل الاعضاء
- الغاء تثبيت : ل الغاء تثبيت الكلمة
- المكتومين : لعرض قائمة المكتومين
- الكلمات الممنوعة : لعرض قائمة الكلمات الممنوعة
- المحضورين : لعرض قائمة المحضورين
- الادمنية : لعرض قائمة ادمنية المجموعة
- المدراء : ل معرفة المدير
- معلومات المجموعة : لعرض كافة معلومات المجموعة
- القوانين : لمعرفة قوانين المجموعة
- الرابط : ل اضهار رابط المجموعة
❂❂❂❂❂🔹❂🔹❂❂❂❂❂
اوامـرر الـ۶ـضو :- 😸💚

ـ ايـدي (بالرد + المـ۶ـرف + الايـدي)
ـ معلـومات (بالرد + المـ۶ـرف + الايـد
]]

end
return text
end
end
return 
{ patterns = { "^(الاوامر)$", "^[!/#](help)$" }, 
run = DeVx7 }
